#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.rds: Reading...
data.terraform_remote_state.network: Reading...
data.terraform_remote_state.rds: Read complete after 0s
data.terraform_remote_state.network: Read complete after 0s
data.aws_eks_cluster.cluster: Reading...
data.aws_eks_cluster.cluster: Read complete after 0s [id=my_cluster]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.monorepo.kubernetes_config_map.authkeys will be created
  + resource "kubernetes_config_map" "authkeys" {
      + data = {
          + "private_key" = <<-EOT
                -----BEGIN ENCRYPTED PRIVATE KEY-----
                MIIFLTBXBgkqhkiG9w0BBQ0wSjApBgkqhkiG9w0BBQwwHAQIAQM6TXDWdOgCAggA
                MAwGCCqGSIb3DQIJBQAwHQYJYIZIAWUDBAEqBBAVQED54XjPXp963ew49Lb6BIIE
                0Cje4cBfhcSJ9qmY+/8hH8YyocYYyfKxJxlY5bjv41XS9EEMC8R0HaTzNto3IWkI
                iLgR9E5qNyobWdN4waxAlt8w23YValuxL1lXyStEYSDUpgo5bip9wHedDQPf/UBt
                6QsL0FyhOAmaZ8F6rYuvOZd4kIfcyr9b27fnZ9Uk0my6P+BvqtNmocvCno1AwFjp
                Kfrs12qLVok9Xx105feTcQtp5d+4ibcQs1xUrcQ7+MH1/GOZc5KWeq26nY5dyare
                nMzKzCCcEBLj3J83fmTHPkvCd3vVxurHFdw26hHrHQ6W/7VMxyWNQ/fseF6PRl4f
                HNwuH/aRnVNil53NhXGmQK5lzB/paFTCIUxbNcogu5HIaCOfFNGegi/IHW5UQGz7
                F6x4eZ/bfAMo4611XcBryiW1FXoe2+9zGiM61r9fmSkYL+SrFRWWPAu40gIOyvQS
                DHQU9YQo9t4KuELnuZIu9mOqlvtPkxKf1g+Nl59y2Z4HI+/iOSGsA/tpo1eoLZsy
                mYirKL8Opiv9SgNZHEIRUz35ZaZkB5LRSd0RVOwIHO+ySiu6YlKxSTjNZdSXV01t
                QCgapIcaERn6xABhJTFKQNTYb6gzxlr3uG2PWbmDxtg59sw0nBMxYL/gMLLi2J82
                2MoxDSsjJ0k3gy5vc0nRADzsk3NDZ3ckcKtuEbeQfQnduhM5YuWXHJr1V1YdEKRl
                r4p/tkwhyCEl1i5CU3FVnPAM+Yl/PG7E9/dWdD/vAurPjtFALa0X3aGwDnumeKIi
                aPPz5X5cXz44rGsj9FG7m2vQNXgoRID2LPbfer8yJ925CwC0rEy0sl0Gx37IAI25
                PBF56es78ww14fUpXel0W9sUnemD3YBSXf+5CQ2L3IwvdzLQHJvu6pNRDGMDVYme
                Q3RUFLx/IET5xM8cJH0bJPLzk2zsjgpBqLRKixfYDt1+uDP0nxBeBsxy8UCOikSI
                SU1TG7HZaRyrwl73PTjdkDxAt6OJCS3zqAxA+WmI6QQmkSdTjHNKAzd0haK3AIRF
                ZyWaF7nNkQwqZpsnBheV8Wl2UN8lSWqiKyeFwLzFSdtFnmwtQuDXkXGd9NOnhQCD
                GK8lcEMKx6Mtpyr/Il3HI2NusSkof9rF7iAUfhdbFpp6Ebg4FGVmsjbct7BmULHM
                KR1nmqdTZ5IyvFBGUKUOsw6kS+LvJ6V8I9eftg17h6gUnqYBQm7lNV2UASNdqvuJ
                pdbJkDRcfDUG5PN9ENSTaeisbWaF449hKDfCL5h6ck0bHLt0xKsxFKoyF714Nvsh
                dIZt/T+3+hPD869n7wfvd1oO/azjJNel7UHQV5XT/TGSXx/2lD1gMaf7KqIagGBR
                p32Ia2YUDv59xKJy3w001QmqwNvGEsJelljopTSojGfVcPiBG/1oL7O6CMsflkwf
                ZmjLm9BEqu95SNQbzqMpn+WiZXDaEi/wSDxEOMx6Pms3N4NUHz5/7GyH+4CN2RZI
                guHrBPyX3HR8Hs55nQJPhCImDOUxMHelsTf9RjyWrU4h13Y3hjZNSAX/MxAqBQkf
                n3cKV4w2eH0hNYXa+TA4WE90dxZiLBFhhY26hDJpJHsOo58inzkaGha20xed54lm
                2gWdqmk2Fx8ak0x8jIv+2UteJMNvjooW7Bfi5fXDdxYw
                -----END ENCRYPTED PRIVATE KEY-----
            EOT
          + "public_key"  = <<-EOT
                -----BEGIN PUBLIC KEY-----
                MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAvhaXA2JVtmBx8Ej8dIfR
                XjvlML6v/k20F1sjYnMX87KOjLA0lPEOpP77+rApb2Be1Vymf0C4Fa6d5Z3KoZnd
                XxxYrhCApk2D4W2OBhaRKslRNfdmEyvJE5OD/3iUe9+GXbyZnKqqS/00lD7/n3zq
                B7AtUrqvxPvun2yElnu8z8a5CCkUnvtabw5iAVsB/u2qg/DW3ICSWzXjxlCF0N46
                36bcQeUHFZBLDzmDIgxYjS497FmN3tvAwMBIV1RJjAseS4LI9wvb1oO3s2qGCAf+
                qI4WZp7KZqL28vTBeXomLa9248TCU7shgbztsFc9aJvNRjlA8z474c5V/Y/J57an
                cQIDAQAB
                -----END PUBLIC KEY-----
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "authkeys"
          + namespace        = "testing-branch"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.monorepo.kubernetes_deployment.monorepo will be created
  + resource "kubernetes_deployment" "monorepo" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "App" = "api"
            }
          + name             = "monorepo"
          + namespace        = "testing-branch"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "App" = "monorepo"
                }
            }

          + strategy {
              + type = (known after apply)

              + rolling_update {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "App" = "monorepo"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "244153473433.dkr.ecr.us-east-1.amazonaws.com/api:testing-branch"
                      + image_pull_policy          = "Always"
                      + name                       = "api"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env_from {

                          + secret_ref {
                              + name = "clj-secrets"
                            }
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "100m"
                              + "memory" = "1Gi"
                            }
                          + requests = {
                              + "cpu"    = "100m"
                              + "memory" = "1Gi"
                            }
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)

                          + node_publish_secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.monorepo.kubernetes_namespace.namespace will be created
  + resource "kubernetes_namespace" "namespace" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "testing-branch"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.monorepo.kubernetes_secret.clj-secrets will be created
  + resource "kubernetes_secret" "clj-secrets" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "clj-secrets"
          + namespace        = "testing-branch"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + rds = "prod-monorepordsinstance.ckofm37taefw.us-east-1.rds.amazonaws.com"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rafael-nearshoredev, Action: `pull_request`*